<?php
/*
 * |-----------------------------------------------------------------------------------------------------------
 * | Laravel 8 + PHP 8.0 + LayUI + 基于CMS 开发
 * |-----------------------------------------------------------------------------------------------------------
 * | 开发者: 云飞
 * |-----------------------------------------------------------------------------------------------------------
 * | 文件: RoleModel.php
 * |-----------------------------------------------------------------------------------------------------------
 * | 项目: VIP活动申请
 * |-----------------------------------------------------------------------------------------------------------
 * | 创建时间: Monday, 20th December 2021 10:39:45 am
 * |-----------------------------------------------------------------------------------------------------------
 * | Copyright 2021 - 2025
 * |-----------------------------------------------------------------------------------------------------------
 */

namespace App\Models\Admin;

use Illuminate\Database\Eloquent\Model;

class RoleModel extends Model
{

    /**
     * The table associated with the model.
     *
     * @var string
     */
    protected $table = 'role';

    public function __construct($data = [])
    {
        $this->data = $data;
    }

    public function getAllRole(){
        $data = $this->data;
        
        $column = ['id','role_name'];
        if(!empty($data['id'])){

            $result =  self::where('status',1)->where('id',$data['id'])->get($column)->toArray();

        }else{
        
            $result =  self::where('status',1)->get($column)->toArray();
        }

        return $result;
        
    }
}
